{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "BAR_END": 5,
      "BAR_START": 6,
      "TIME_DELTA=0.033333333333333215": 7,
      "NOTE_OFF=64": 8,
      "NOTE_ON=64": 9,
      "NOTE_OFF=59": 10,
      "NOTE_ON=59": 11,
      "NOTE_OFF=38": 12,
      "NOTE_ON=38": 13,
      "NOTE_OFF=42": 14,
      "NOTE_ON=42": 15,
      "NOTE_OFF=62": 16,
      "NOTE_ON=62": 17,
      "TIME_DELTA=2.0": 18,
      "NOTE_OFF=67": 19,
      "NOTE_ON=67": 20,
      "NOTE_OFF=61": 21,
      "NOTE_ON=61": 22,
      "NOTE_OFF=66": 23,
      "NOTE_ON=66": 24,
      "TRACK_END": 25,
      "TRACK_START": 26,
      "NOTE_OFF=36": 27,
      "NOTE_ON=36": 28,
      "TIME_DELTA=1.9666666666666668": 29,
      "NOTE_OFF=54": 30,
      "NOTE_ON=54": 31,
      "TIME_DELTA=1.0": 32,
      "NOTE_OFF=69": 33,
      "NOTE_ON=69": 34,
      "NOTE_OFF=57": 35,
      "NOTE_ON=57": 36,
      "NOTE_OFF=68": 37,
      "NOTE_ON=68": 38,
      "NOTE_OFF=71": 39,
      "NOTE_ON=71": 40,
      "NOTE_OFF=63": 41,
      "NOTE_ON=63": 42,
      "NOTE_OFF=60": 43,
      "NOTE_ON=60": 44,
      "NOTE_OFF=35": 45,
      "NOTE_ON=35": 46,
      "NOTE_OFF=55": 47,
      "NOTE_ON=55": 48,
      "TIME_DELTA=0.041666666666666075": 49,
      "NOTE_OFF=43": 50,
      "NOTE_ON=43": 51,
      "TIME_DELTA=0.041666666666666664": 52,
      "TIME_DELTA=0.16666666666666666": 53,
      "NOTE_OFF=65": 54,
      "NOTE_ON=65": 55,
      "NOTE_OFF=56": 56,
      "NOTE_ON=56": 57,
      "NOTE_OFF=76": 58,
      "NOTE_ON=76": 59,
      "TIME_DELTA=0.9666666666666668": 60,
      "NOTE_OFF=70": 61,
      "NOTE_ON=70": 62,
      "NOTE_OFF=48": 63,
      "NOTE_ON=48": 64,
      "NOTE_OFF=47": 65,
      "NOTE_ON=47": 66,
      "NOTE_OFF=72": 67,
      "NOTE_ON=72": 68,
      "TIME_DELTA=0.08333333333333333": 69,
      "NOTE_OFF=50": 70,
      "NOTE_OFF=58": 71,
      "NOTE_ON=50": 72,
      "NOTE_ON=58": 73,
      "NOTE_OFF=33": 74,
      "NOTE_ON=33": 75,
      "NOTE_OFF=52": 76,
      "NOTE_ON=52": 77,
      "NOTE_OFF=41": 78,
      "NOTE_ON=41": 79,
      "NOTE_OFF=53": 80,
      "NOTE_ON=53": 81,
      "TIME_DELTA=0.625": 82,
      "TIME_DELTA=0.5": 83,
      "NOTE_OFF=73": 84,
      "NOTE_ON=73": 85,
      "TIME_DELTA=0.125": 86,
      "NOTE_OFF=74": 87,
      "NOTE_ON=74": 88,
      "TIME_DELTA=0.375": 89,
      "NOTE_OFF=40": 90,
      "NOTE_ON=40": 91,
      "NOTE_OFF=46": 92,
      "NOTE_ON=46": 93,
      "NOTE_OFF=78": 94,
      "NOTE_ON=78": 95,
      "DENSITY=0": 96,
      "NOTE_OFF=81": 97,
      "NOTE_ON=81": 98,
      "TIME_DELTA=0.04166666666666696": 99,
      "TIME_DELTA=0.0625": 100,
      "NOTE_OFF=45": 101,
      "NOTE_ON=45": 102,
      "TIME_DELTA=0.3333333333333333": 103,
      "NOTE_OFF=31": 104,
      "NOTE_ON=31": 105,
      "NOTE_OFF=83": 106,
      "NOTE_ON=83": 107,
      "NOTE_OFF=80": 108,
      "NOTE_ON=80": 109,
      "TIME_DELTA=0.4666666666666668": 110,
      "TIME_DELTA=1.958333333333334": 111,
      "TIME_DELTA=1.8333333333333333": 112,
      "NOTE_OFF=79": 113,
      "NOTE_ON=79": 114,
      "TIME_DELTA=0.08333333333333393": 115,
      "NOTE_OFF=37": 116,
      "NOTE_ON=37": 117,
      "NOTE_OFF=34": 118,
      "NOTE_ON=34": 119,
      "TIME_DELTA=3.966666666666667": 120,
      "NOTE_OFF=75": 121,
      "NOTE_ON=75": 122,
      "TIME_DELTA=0.6666666666666666": 123,
      "TIME_DELTA=0.8333333333333334": 124,
      "NOTE_OFF=44": 125,
      "NOTE_ON=44": 126,
      "NOTE_OFF=49": 127,
      "NOTE_ON=49": 128,
      "TIME_DELTA=0.16666666666666607": 129,
      "NOTE_OFF=77": 130,
      "NOTE_ON=77": 131,
      "NOTE_OFF=39": 132,
      "NOTE_ON=39": 133,
      "TIME_DELTA=1.5333333333333332": 134,
      "TIME_DELTA=0.020833333333333925": 135,
      "TIME_DELTA=0.875": 136,
      "NOTE_OFF=29": 137,
      "NOTE_ON=29": 138,
      "TIME_DELTA=0.25": 139,
      "NOTE_OFF=51": 140,
      "NOTE_ON=51": 141,
      "TIME_DELTA=5.966666666666667": 142,
      "TIME_DELTA=0.1875": 143,
      "NOTE_OFF=85": 144,
      "NOTE_ON=85": 145,
      "TIME_DELTA=1.5": 146,
      "TIME_DELTA=0.9583333333333334": 147,
      "TIME_DELTA=0.3125": 148,
      "TIME_DELTA=0.75": 149,
      "TIME_DELTA=1.958333333333333": 150,
      "TIME_DELTA=0.9583333333333339": 151,
      "TIME_DELTA=0.8333333333333339": 152,
      "TIME_DELTA=1.125": 153,
      "TIME_DELTA=1.9583333333333333": 154,
      "TIME_DELTA=4.0": 155,
      "TIME_DELTA=0.08333333333333304": 156,
      "TIME_DELTA=0.3333333333333339": 157,
      "TIME_DELTA=0.020833333333333037": 158,
      "TIME_DELTA=0.40000000000000036": 159,
      "TIME_DELTA=0.6666666666666661": 160,
      "TIME_DELTA=0.33333333333333304": 161,
      "TIME_DELTA=1.1666666666666667": 162,
      "TIME_DELTA=1.0416666666666667": 163,
      "NOTE_OFF=82": 164,
      "NOTE_ON=82": 165,
      "NOTE_OFF=28": 166,
      "NOTE_ON=28": 167,
      "TIME_DELTA=0.04166666666666652": 168,
      "TIME_DELTA=0.20833333333333393": 169,
      "TIME_DELTA=0.020833333333333332": 170,
      "TIME_DELTA=0.9166666666666666": 171,
      "TIME_DELTA=16.0": 172,
      "TIME_DELTA=1.6666666666666667": 173,
      "DENSITY=4": 174,
      "NOTE_OFF=86": 175,
      "NOTE_ON=86": 176,
      "INST=0": 177,
      "TIME_DELTA=3.958333333333334": 178,
      "TIME_DELTA=1.5999999999999996": 179,
      "TIME_DELTA=1.0833333333333333": 180,
      "TIME_DELTA=0.16666666666666696": 181,
      "TIME_DELTA=6.0": 182,
      "TIME_DELTA=0.9375": 183,
      "TIME_DELTA=0.6875": 184,
      "DENSITY=3": 185,
      "TIME_DELTA=0.2916666666666661": 186,
      "DENSITY=2": 187,
      "NOTE_OFF=32": 188,
      "NOTE_ON=32": 189,
      "TIME_DELTA=1.25": 190,
      "TIME_DELTA=0.9166666666666661": 191,
      "GENRE=POP": 192,
      "PIECE_START": 193,
      "TIME_SIGNATURE": 194,
      "DENSITY=1": 195,
      "TIME_DELTA=0.833333333333333": 196,
      "TIME_DELTA=1.9166666666666667": 197,
      "TIME_DELTA=9.966666666666667": 198,
      "TIME_DELTA=0.04166666666666785": 199,
      "TIME_DELTA=2.966666666666667": 200,
      "TIME_DELTA=0.7916666666666666": 201,
      "TIME_DELTA=1.0625": 202,
      "TIME_DELTA=0.666666666666667": 203,
      "TIME_DELTA=1.916666666666666": 204,
      "TIME_DELTA=0.6458333333333334": 205,
      "TIME_DELTA=1.875": 206,
      "TIME_DELTA=0.13333333333333286": 207,
      "TIME_DELTA=1.9666666666666666": 208,
      "NOTE_OFF=84": 209,
      "NOTE_ON=84": 210,
      "TIME_DELTA=0.06666666666666667": 211,
      "TIME_DELTA=0.03333333333333333": 212,
      "NOTE_OFF=30": 213,
      "NOTE_ON=30": 214,
      "TIME_DELTA=1.979166666666666": 215,
      "TIME_DELTA=3.0": 216,
      "TIME_DELTA=0.20833333333333334": 217,
      "NOTE_OFF=26": 218,
      "NOTE_ON=26": 219,
      "TIME_DELTA=0.03333333333333344": 220,
      "TIME_DELTA=0.7708333333333334": 221,
      "TIME_DELTA=0.20833333333333304": 222,
      "TIME_DELTA=1.0333333333333332": 223,
      "TIME_DELTA=0.29166666666666696": 224,
      "NOTE_OFF=88": 225,
      "NOTE_ON=88": 226,
      "TIME_DELTA=0.14583333333333334": 227,
      "TIME_DELTA=1.166666666666666": 228,
      "TIME_DELTA=1.041666666666666": 229,
      "TIME_DELTA=0.7083333333333334": 230,
      "TIME_DELTA=0.958333333333333": 231,
      "TIME_DELTA=0.6666666666666679": 232,
      "TIME_DELTA=0.1": 233,
      "TIME_DELTA=8.0": 234,
      "TIME_DELTA=0.04166666666666674": 235,
      "TIME_DELTA=1.833333333333334": 236,
      "TIME_DELTA=1.666666666666666": 237,
      "TIME_DELTA=15.966666666666667": 238,
      "TIME_DELTA=1.375": 239,
      "TIME_DELTA=0.9791666666666666": 240,
      "TIME_DELTA=0.13333333333333333": 241,
      "TIME_DELTA=1.0208333333333333": 242,
      "TIME_DELTA=0.3541666666666667": 243,
      "TIME_DELTA=0.9666666666666667": 244,
      "TIME_DELTA=0.02083333333333215": 245,
      "TIME_DELTA=0.2916666666666667": 246,
      "TIME_DELTA=0.16666666666666785": 247,
      "TIME_DELTA=1.75": 248,
      "TIME_DELTA=0.8125": 249,
      "TIME_DELTA=1.2083333333333333": 250,
      "TIME_DELTA=0.22916666666666607": 251,
      "TIME_DELTA=1.395833333333334": 252,
      "TIME_DELTA=0.06666666666666643": 253,
      "TIME_DELTA=1.666666666666667": 254,
      "TIME_DELTA=0.08333333333333348": 255,
      "TIME_DELTA=0.4375": 256,
      "TIME_DELTA=0.5833333333333334": 257,
      "TIME_DELTA=0.4666666666666667": 258,
      "TIME_DELTA=0.4583333333333333": 259,
      "TIME_DELTA=0.7916666666666661": 260,
      "TIME_DELTA=1.3333333333333333": 261,
      "TIME_DELTA=0.9791666666666661": 262,
      "TIME_DELTA=1.083333333333334": 263,
      "NOTE_OFF=87": 264,
      "NOTE_ON=87": 265,
      "TIME_DELTA=0.5333333333333332": 266,
      "INST=48": 267,
      "TIME_DELTA=0.7083333333333339": 268,
      "TIME_DELTA=1.6": 269,
      "TIME_DELTA=1.395833333333333": 270,
      "TIME_DELTA=1.625": 271,
      "TIME_DELTA=1.916666666666667": 272,
      "TIME_DELTA=0.5416666666666666": 273,
      "TIME_DELTA=0.791666666666667": 274,
      "TIME_DELTA=0.4166666666666667": 275,
      "TIME_DELTA=15.958333333333334": 276,
      "TIME_DELTA=0.02083333333333348": 277,
      "TIME_DELTA=0.08333333333333215": 278,
      "TIME_DELTA=0.14583333333333393": 279,
      "TIME_DELTA=0.22916666666666696": 280,
      "TIME_DELTA=0.2": 281,
      "TIME_DELTA=1.166666666666667": 282,
      "TIME_DELTA=3.9583333333333335": 283,
      "TIME_DELTA=1.041666666666667": 284,
      "TIME_DELTA=0.583333333333333": 285,
      "TIME_DELTA=10.0": 286,
      "NOTE_OFF=90": 287,
      "NOTE_ON=90": 288,
      "TIME_DELTA=0.8000000000000007": 289,
      "NOTE_OFF=89": 290,
      "NOTE_ON=89": 291,
      "NOTE_OFF=93": 292,
      "NOTE_ON=93": 293,
      "TIME_DELTA=0.3999999999999999": 294,
      "TIME_DELTA=0.8666666666666671": 295,
      "TIME_DELTA=1.333333333333334": 296,
      "INST=33": 297,
      "TIME_DELTA=0.16666666666666652": 298,
      "TIME_DELTA=12.0": 299,
      "TIME_DELTA=0.9583333333333335": 300,
      "TIME_DELTA=0.4583333333333339": 301,
      "TIME_DELTA=0.5833333333333339": 302,
      "TIME_DELTA=0.5416666666666661": 303,
      "TIME_DELTA=0.33333333333333326": 304,
      "TIME_DELTA=1.7763568394002505e-15": 305,
      "INST=24": 306,
      "TIME_DELTA=0.1999999999999993": 307,
      "TIME_DELTA=0.13333333333333375": 308,
      "TIME_DELTA=0.20000000000000018": 309,
      "TIME_DELTA=0.4166666666666661": 310,
      "TIME_DELTA=1.7916666666666667": 311,
      "TIME_DELTA=1.9791666666666667": 312,
      "TIME_DELTA=0.33333333333333215": 313,
      "TIME_DELTA=0.26666666666666666": 314,
      "TIME_DELTA=1.208333333333334": 315,
      "TIME_DELTA=1.2916666666666667": 316,
      "TIME_DELTA=0.10416666666666607": 317,
      "TIME_DELTA=7.966666666666667": 318,
      "TIME_DELTA=0.36666666666666714": 319,
      "TIME_DELTA=0.5625": 320,
      "TIME_DELTA=0.916666666666667": 321,
      "TIME_DELTA=0.7999999999999998": 322,
      "TIME_DELTA=2.0416666666666665": 323,
      "TIME_DELTA=0.8666666666666667": 324,
      "TIME_DELTA=1.020833333333334": 325,
      "TIME_DELTA=0.708333333333333": 326,
      "TIME_DELTA=1.0416666666666665": 327,
      "TIME_DELTA=1.1875": 328,
      "TIME_DELTA=1.7083333333333333": 329,
      "NOTE_OFF=91": 330,
      "NOTE_ON=91": 331,
      "TIME_DELTA=5.958333333333333": 332,
      "TIME_DELTA=7.0": 333,
      "TIME_DELTA=2.958333333333334": 334,
      "TIME_DELTA=0.541666666666667": 335,
      "TIME_DELTA=1.208333333333333": 336,
      "TIME_DELTA=0.41666666666666696": 337,
      "TIME_DELTA=0.8333333333333335": 338,
      "INST=52": 339,
      "TIME_DELTA=0.3": 340,
      "TIME_DELTA=1.291666666666666": 341,
      "TIME_DELTA=1.979166666666667": 342,
      "TIME_DELTA=15.833333333333334": 343,
      "TIME_DELTA=2.9583333333333335": 344,
      "TIME_DELTA=0.23333333333333334": 345,
      "TIME_DELTA=8.881784197001252e-16": 346,
      "TIME_DELTA=0.8541666666666661": 347,
      "TIME_DELTA=0.8958333333333339": 348,
      "TIME_DELTA=0.22916666666666666": 349,
      "TIME_DELTA=0.033333333333333326": 350,
      "TIME_DELTA=1.083333333333333": 351,
      "TIME_DELTA=0.02083333333333333": 352,
      "TIME_DELTA=0.3333333333333335": 353,
      "TIME_DELTA=0.45833333333333304": 354,
      "TIME_DELTA=0.6666666666666667": 355,
      "INST=16": 356,
      "INST=35": 357,
      "TIME_DELTA=0.016666666666666666": 358,
      "TIME_DELTA=0.20833333333333215": 359,
      "INST=25": 360,
      "NOTE_OFF=95": 361,
      "NOTE_ON=95": 362,
      "TIME_DELTA=0.1333333333333333": 363,
      "TIME_DELTA=0.29166666666666785": 364,
      "TIME_DELTA=2.033333333333333": 365,
      "TIME_DELTA=0.16666666666666674": 366,
      "TIME_DELTA=0.979166666666667": 367,
      "TIME_DELTA=1.833333333333333": 368,
      "TIME_DELTA=3.533333333333333": 369,
      "TIME_DELTA=3.8333333333333335": 370,
      "TIME_DELTA=0.10416666666666667": 371,
      "INST=53": 372,
      "TIME_DELTA=0.5833333333333335": 373,
      "TIME_DELTA=0.7666666666666667": 374,
      "TIME_DELTA=0.9166666666666665": 375,
      "NOTE_OFF=24": 376,
      "NOTE_ON=24": 377,
      "TIME_DELTA=1.3125": 378,
      "NOTE_OFF=94": 379,
      "NOTE_ON=94": 380,
      "TIME_DELTA=1.0833333333333335": 381,
      "TIME_DELTA=0.8958333333333334": 382,
      "TIME_DELTA=0.02083333333333326": 383,
      "TIME_DELTA=1.4166666666666667": 384,
      "TIME_DELTA=3.833333333333334": 385,
      "NOTE_OFF=25": 386,
      "NOTE_ON=25": 387,
      "TIME_DELTA=5.666666666666667": 388,
      "TIME_DELTA=5.833333333333333": 389,
      "TIME_DELTA=15.875": 390,
      "TIME_DELTA=5.0": 391,
      "TIME_DELTA=0.10416666666666696": 392,
      "TIME_DELTA=1.333333333333333": 393,
      "TIME_DELTA=1.9166666666666665": 394,
      "INST=DRUMS": 395,
      "TIME_DELTA=1.5416666666666667": 396,
      "TIME_DELTA=1.5833333333333333": 397,
      "TIME_DELTA=0.09999999999999964": 398,
      "TIME_DELTA=0.2708333333333339": 399,
      "TIME_DELTA=0.854166666666667": 400,
      "TIME_DELTA=1.9375": 401,
      "TIME_DELTA=2.0833333333333335": 402,
      "TIME_DELTA=0.20833333333333348": 403,
      "INST=29": 404,
      "TIME_DELTA=0.7708333333333339": 405,
      "TIME_DELTA=5.958333333333332": 406,
      "NOTE_OFF=27": 407,
      "NOTE_ON=27": 408,
      "TIME_DELTA=0.1874999999999999": 409,
      "TIME_DELTA=0.2708333333333333": 410,
      "TIME_DELTA=0.8541666666666666": 411,
      "TIME_DELTA=1.8125": 412,
      "TIME_DELTA=0.36666666666666664": 413,
      "TIME_DELTA=0.8": 414,
      "TIME_DELTA=1.104166666666666": 415,
      "TIME_DELTA=4.5": 416,
      "TIME_DELTA=1.4583333333333333": 417,
      "TIME_DELTA=1.791666666666666": 418,
      "TIME_DELTA=0.6666666666666665": 419,
      "TIME_DELTA=0.025000000000000355": 420,
      "TIME_DELTA=0.18333333333333357": 421,
      "TIME_DELTA=0.7291666666666661": 422,
      "INST=49": 423,
      "TIME_DELTA=3.6666666666666665": 424,
      "TIME_DELTA=0.8333333333333333": 425,
      "TIME_DELTA=5.916666666666667": 426,
      "TIME_DELTA=0.29166666666666674": 427,
      "TIME_DELTA=1.145833333333334": 428,
      "TIME_DELTA=9.666666666666666": 429,
      "TIME_DELTA=0.4791666666666667": 430,
      "TIME_DELTA=0.8333333333333321": 431,
      "INST=1": 432,
      "TIME_DELTA=0.04166666666666663": 433,
      "TIME_DELTA=0.7": 434,
      "TIME_DELTA=0.645833333333333": 435,
      "NOTE_OFF=92": 436,
      "NOTE_ON=92": 437,
      "TIME_DELTA=0.6750000000000007": 438,
      "TIME_DELTA=5.375": 439,
      "TIME_DELTA=0.30833333333333357": 440,
      "TIME_DELTA=0.5208333333333339": 441,
      "TIME_DELTA=0.9": 442,
      "TIME_DELTA=0.36666666666666625": 443,
      "TIME_DELTA=1.291666666666667": 444,
      "TIME_DELTA=1.583333333333334": 445,
      "TIME_DELTA=1.3333333333333335": 446,
      "TIME_DELTA=0.43333333333333335": 447,
      "TIME_DELTA=1.1041666666666667": 448,
      "TIME_DELTA=2.6666666666666665": 449,
      "TIME_DELTA=3.875": 450,
      "TIME_DELTA=3.979166666666666": 451,
      "TIME_DELTA=1.1041666666666665": 452,
      "TIME_DELTA=0.2666666666666666": 453,
      "TIME_DELTA=0.2916666666666665": 454,
      "TIME_DELTA=0.33333333333333337": 455,
      "TIME_DELTA=0.895833333333333": 456,
      "TIME_DELTA=2.1666666666666665": 457,
      "INST=30": 458,
      "TIME_DELTA=0.41666666666666785": 459,
      "TIME_DELTA=0.14583333333333304": 460,
      "TIME_DELTA=0.27083333333333304": 461,
      "TIME_DELTA=0.6333333333333333": 462,
      "TIME_DELTA=1.458333333333334": 463,
      "TIME_DELTA=2.3333333333333335": 464,
      "TIME_DELTA=2.125": 465,
      "TIME_DELTA=3.5": 466,
      "TIME_DELTA=0.4": 467,
      "TIME_DELTA=0.7333333333333333": 468,
      "TIME_DELTA=1.4000000000000004": 469,
      "TIME_DELTA=15.916666666666666": 470,
      "TIME_DELTA=1.104166666666667": 471,
      "TIME_DELTA=11.979166666666666": 472,
      "TIME_DELTA=0.3958333333333339": 473,
      "TIME_DELTA=0.8666666666666663": 474,
      "TIME_DELTA=14.0": 475,
      "TIME_DELTA=0.6041666666666666": 476,
      "TIME_DELTA=3.333333333333334": 477,
      "TIME_DELTA=0.08333333333333326": 478,
      "TIME_DELTA=0.9333333333333336": 479,
      "TIME_DELTA=0.9999999999999999": 480,
      "TIME_DELTA=1.895833333333334": 481,
      "TIME_DELTA=15.333333333333334": 482,
      "TIME_DELTA=1.1666666666666665": 483,
      "TIME_DELTA=1.8": 484,
      "TIME_DELTA=2.041666666666667": 485,
      "TIME_DELTA=3.375": 486,
      "TIME_DELTA=5.5": 487,
      "TIME_DELTA=0.6458333333333339": 488,
      "TIME_DELTA=1.0333333333333334": 489,
      "TIME_DELTA=4.416666666666666": 490,
      "TIME_DELTA=6.5": 491,
      "TIME_DELTA=0.5208333333333334": 492,
      "TIME_DELTA=0.9999999999999991": 493,
      "TIME_DELTA=0.35416666666666696": 494,
      "TIME_DELTA=0.43333333333333357": 495,
      "TIME_DELTA=1.1": 496,
      "TIME_DELTA=0.7916666666666665": 497,
      "TIME_DELTA=1.9333333333333333": 498,
      "TIME_DELTA=15.666666666666666": 499,
      "TIME_DELTA=9.958333333333334": 500,
      "TIME_DELTA=1.708333333333334": 501,
      "TIME_DELTA=1.8666666666666667": 502,
      "TIME_DELTA=15.770833333333334": 503,
      "TIME_DELTA=3.75": 504,
      "TIME_DELTA=5.875": 505,
      "TIME_DELTA=0.11666666666666667": 506,
      "TIME_DELTA=1.1333333333333329": 507,
      "TIME_DELTA=12.8": 508,
      "TIME_DELTA=1.145833333333333": 509,
      "TIME_DELTA=3.9791666666666665": 510,
      "TIME_DELTA=9.916666666666666": 511,
      "TIME_DELTA=0.6833333333333333": 512,
      "TIME_DELTA=1.541666666666666": 513,
      "TIME_DELTA=7.958333333333333": 514,
      "TIME_DELTA=0.6": 515,
      "TIME_DELTA=15.5": 516,
      "TIME_DELTA=9.458333333333334": 517,
      "TIME_DELTA=1.229166666666666": 518,
      "TIME_DELTA=1.3958333333333333": 519,
      "TIME_DELTA=0.4583333333333335": 520,
      "TIME_DELTA=1.416666666666666": 521,
      "NOTE_OFF=23": 522,
      "NOTE_ON=23": 523,
      "TIME_DELTA=2.8333333333333335": 524,
      "TIME_DELTA=0.729166666666667": 525,
      "TIME_DELTA=3.033333333333333": 526,
      "TIME_DELTA=4.166666666666667": 527,
      "TIME_DELTA=0.05": 528,
      "TIME_DELTA=0.7291666666666666": 529,
      "TIME_DELTA=1.354166666666666": 530,
      "TIME_DELTA=1.4": 531,
      "TIME_DELTA=2.166666666666666": 532,
      "TIME_DELTA=2.5": 533,
      "TIME_DELTA=3.9166666666666665": 534,
      "INST=32": 535,
      "TIME_DELTA=0.4166666666666665": 536,
      "TIME_DELTA=0.5833333333333321": 537,
      "TIME_DELTA=1.1999999999999993": 538,
      "TIME_DELTA=5.333333333333333": 539,
      "INST=39": 540,
      "TIME_DELTA=1.9": 541,
      "TIME_DELTA=0.5999999999999996": 542,
      "TIME_DELTA=6.166666666666667": 543,
      "TIME_DELTA=9.0": 544,
      "INST=28": 545,
      "TIME_DELTA=0.22499999999999964": 546,
      "TIME_DELTA=0.5333333333333333": 547,
      "TIME_DELTA=0.9333333333333333": 548,
      "TIME_DELTA=0.7333333333333334": 549,
      "TIME_DELTA=1.2333333333333334": 550,
      "TIME_DELTA=1.8958333333333333": 551,
      "NOTE_OFF=96": 552,
      "NOTE_ON=96": 553,
      "TIME_DELTA=0.3541666666666661": 554,
      "TIME_DELTA=1.2083333333333335": 555,
      "TIME_DELTA=1.2666666666666666": 556,
      "TIME_DELTA=1.9583333333333321": 557,
      "TIME_DELTA=0.9000000000000004": 558,
      "TIME_DELTA=1.020833333333333": 559,
      "TIME_DELTA=3.3333333333333335": 560,
      "TIME_DELTA=0.2333333333333325": 561,
      "TIME_DELTA=0.65": 562,
      "TIME_DELTA=1.354166666666667": 563,
      "TIME_DELTA=11.966666666666667": 564,
      "TIME_DELTA=2.375": 565,
      "TIME_DELTA=3.25": 566,
      "INST=27": 567,
      "TIME_DELTA=3.916666666666666": 568,
      "TIME_DELTA=1.604166666666666": 569,
      "TIME_DELTA=15.166666666666666": 570,
      "TIME_DELTA=4.291666666666667": 571,
      "TIME_DELTA=9.125": 572,
      "TIME_DELTA=0.10416666666666785": 573,
      "TIME_DELTA=0.770833333333333": 574,
      "TIME_DELTA=1.1458333333333333": 575,
      "TIME_DELTA=3.1666666666666665": 576,
      "TIME_DELTA=5.291666666666667": 577,
      "TIME_DELTA=5.9375": 578,
      "TIME_DELTA=0.39583333333333304": 579,
      "TIME_DELTA=0.45833333333333215": 580,
      "TIME_DELTA=0.7666666666666675": 581,
      "TIME_DELTA=1.458333333333333": 582,
      "TIME_DELTA=1.5333333333333334": 583,
      "TIME_DELTA=2.041666666666666": 584,
      "TIME_DELTA=0.19999999999999996": 585,
      "TIME_DELTA=2.625": 586,
      "TIME_DELTA=4.440892098500626e-16": 587,
      "TIME_DELTA=0.14583333333333215": 588,
      "TIME_DELTA=1.5625": 589,
      "TIME_DELTA=7.979166666666667": 590,
      "INST=50": 591,
      "INST=75": 592,
      "TIME_DELTA=0.35": 593,
      "TIME_DELTA=0.4791666666666661": 594,
      "TIME_DELTA=0.5416666666666665": 595,
      "TIME_DELTA=1.0666666666666667": 596,
      "TIME_DELTA=1.895833333333333": 597,
      "TIME_DELTA=5.708333333333333": 598,
      "TIME_DELTA=0.3000000000000007": 599,
      "TIME_DELTA=0.5416666666666679": 600,
      "TIME_DELTA=0.9583333333333321": 601,
      "TIME_DELTA=1.3333333333333321": 602,
      "TIME_DELTA=1.7333333333333334": 603,
      "INST=68": 604,
      "NOTE_OFF=97": 605,
      "NOTE_ON=97": 606,
      "TIME_DELTA=0.3666666666666667": 607,
      "TIME_DELTA=5.479166666666667": 608,
      "INST=18": 609,
      "TIME_DELTA=0.10416666666666652": 610,
      "TIME_DELTA=0.520833333333333": 611,
      "TIME_DELTA=1.8333333333333321": 612,
      "TIME_DELTA=5.979166666666667": 613,
      "TIME_DELTA=1.6666666666666679": 614,
      "TIME_DELTA=1.7291666666666667": 615,
      "TIME_DELTA=2.083333333333334": 616,
      "TIME_DELTA=15.75": 617,
      "TIME_DELTA=2.25": 618,
      "TIME_DELTA=6.333333333333333": 619,
      "TIME_DELTA=0.020833333333333315": 620,
      "TIME_DELTA=0.6041666666666661": 621,
      "TIME_DELTA=1.2916666666666665": 622,
      "TIME_DELTA=2.166666666666667": 623,
      "TIME_DELTA=0.2666666666666675": 624,
      "TIME_DELTA=0.5666666666666667": 625,
      "TIME_DELTA=1.270833333333333": 626,
      "TIME_DELTA=11.958333333333334": 627,
      "TIME_DELTA=3.1999999999999993": 628,
      "TIME_DELTA=3.958333333333333": 629,
      "TIME_DELTA=6.916666666666667": 630,
      "TIME_DELTA=0.06666666666666665": 631,
      "TIME_DELTA=0.27083333333333215": 632,
      "TIME_DELTA=0.7083333333333321": 633,
      "TIME_DELTA=0.7666666666666666": 634,
      "TIME_DELTA=0.9999999999999998": 635,
      "TIME_DELTA=1.0416666666666679": 636,
      "TIME_DELTA=1.4375": 637,
      "TIME_DELTA=3.666666666666666": 638,
      "TIME_DELTA=4.041666666666667": 639,
      "TIME_DELTA=4.666666666666667": 640,
      "NOTE_OFF=98": 641,
      "NOTE_ON=98": 642,
      "TIME_DELTA=0.7083333333333335": 643,
      "TIME_DELTA=1.0000000000000009": 644,
      "TIME_DELTA=2.333333333333333": 645,
      "TIME_DELTA=4.333333333333333": 646,
      "TIME_DELTA=5.208333333333333": 647,
      "TIME_DELTA=5.833333333333332": 648,
      "TIME_DELTA=7.75": 649,
      "TIME_DELTA=7.958333333333332": 650,
      "TIME_DELTA=0.2999999999999998": 651,
      "TIME_DELTA=1.0666666666666664": 652,
      "TIME_DELTA=15.583333333333334": 653,
      "TIME_DELTA=4.033333333333333": 654,
      "TIME_DELTA=9.75": 655,
      "INST=65": 656,
      "TIME_DELTA=0.12500000000000178": 657,
      "TIME_DELTA=3.5833333333333335": 658,
      "TIME_DELTA=3.7916666666666665": 659,
      "TIME_DELTA=4.958333333333332": 660,
      "INST=56": 661,
      "TIME_DELTA=1.1458333333333335": 662,
      "TIME_DELTA=15.0": 663,
      "INST=19": 664,
      "INST=73": 665,
      "INST=88": 666,
      "TIME_DELTA=0.4999999999999991": 667,
      "TIME_DELTA=0.5833333333333333": 668,
      "TIME_DELTA=0.7083333333333333": 669,
      "TIME_DELTA=1.1333333333333333": 670,
      "TIME_DELTA=15.791666666666666": 671,
      "TIME_DELTA=2.9166666666666665": 672,
      "INST=17": 673,
      "INST=37": 674,
      "TIME_DELTA=0.15": 675,
      "TIME_DELTA=0.20833333333333326": 676,
      "TIME_DELTA=1.4666666666666668": 677,
      "TIME_DELTA=1.9166666666666679": 678,
      "TIME_DELTA=1.9583333333333335": 679,
      "TIME_DELTA=3.4583333333333335": 680,
      "TIME_DELTA=9.416666666666666": 681,
      "TIME_DELTA=0.9791666666666665": 682,
      "TIME_DELTA=1.7": 683,
      "TIME_DELTA=2.75": 684,
      "TIME_DELTA=0.7000000000000002": 685,
      "TIME_DELTA=0.9166666666666679": 686,
      "TIME_DELTA=0.9999999999999982": 687,
      "TIME_DELTA=3.5416666666666665": 688,
      "TIME_DELTA=0.6458333333333333": 689,
      "TIME_DELTA=1.270833333333334": 690,
      "TIME_DELTA=1.708333333333333": 691,
      "TIME_DELTA=1.9999999999999991": 692,
      "TIME_DELTA=3.791666666666666": 693,
      "TIME_DELTA=9.875": 694,
      "TIME_DELTA=0.20000000000000107": 695,
      "TIME_DELTA=0.2666666666666657": 696,
      "TIME_DELTA=1.0999999999999996": 697,
      "TIME_DELTA=1.2": 698,
      "TIME_DELTA=0.2708333333333335": 699,
      "TIME_DELTA=1.7666666666666666": 700,
      "TIME_DELTA=15.854166666666666": 701,
      "TIME_DELTA=1.6666666666666665": 702,
      "TIME_DELTA=1.6875": 703,
      "TIME_DELTA=1.8333333333333335": 704,
      "TIME_DELTA=2.875": 705,
      "TIME_DELTA=0.06666666666666687": 706,
      "TIME_DELTA=0.18333333333333332": 707,
      "TIME_DELTA=0.3958333333333333": 708,
      "TIME_DELTA=0.604166666666667": 709,
      "TIME_DELTA=0.9374999999999998": 710,
      "TIME_DELTA=0.9583333333333333": 711,
      "TIME_DELTA=1.2708333333333335": 712,
      "TIME_DELTA=1.791666666666667": 713,
      "TIME_DELTA=3.9375": 714,
      "TIME_DELTA=4.25": 715,
      "TIME_DELTA=5.583333333333333": 716,
      "TIME_DELTA=1.645833333333334": 717,
      "TIME_DELTA=1.7708333333333333": 718,
      "TIME_DELTA=2.4583333333333335": 719,
      "TIME_DELTA=5.166666666666667": 720,
      "INST=2": 721,
      "TIME_DELTA=0.7999999999999989": 722,
      "TIME_DELTA=1.1666666666666679": 723,
      "TIME_DELTA=6.666666666666667": 724,
      "TIME_DELTA=9.25": 725,
      "TIME_DELTA=0.12499999999999956": 726,
      "TIME_DELTA=1.479166666666666": 727,
      "TIME_DELTA=3.0833333333333335": 728,
      "TIME_DELTA=3.7083333333333335": 729,
      "TIME_DELTA=3.854166666666666": 730,
      "TIME_DELTA=4.958333333333333": 731,
      "TIME_DELTA=8.875": 732,
      "TIME_DELTA=9.333333333333334": 733,
      "TIME_DELTA=0.2500000000000009": 734,
      "TIME_DELTA=0.47916666666666696": 735,
      "TIME_DELTA=2.066666666666667": 736,
      "TIME_DELTA=2.2916666666666665": 737,
      "TIME_DELTA=3.625": 738,
      "TIME_DELTA=4.966666666666667": 739,
      "TIME_DELTA=5.125": 740,
      "TIME_DELTA=5.625": 741,
      "TIME_DELTA=0.05000000000000071": 742,
      "TIME_DELTA=0.8541666666666665": 743,
      "TIME_DELTA=0.9999999999999996": 744,
      "TIME_DELTA=5.266666666666667": 745,
      "TIME_DELTA=9.541666666666666": 746,
      "TIME_DELTA=0.062499999999998224": 747,
      "TIME_DELTA=0.2333333333333334": 748,
      "TIME_DELTA=3.2": 749,
      "TIME_DELTA=7.5": 750,
      "TIME_DELTA=9.833333333333334": 751,
      "TIME_DELTA=0.08333333333333334": 752,
      "TIME_DELTA=0.18333333333333268": 753,
      "TIME_DELTA=0.6333333333333329": 754,
      "TIME_DELTA=1.9000000000000004": 755,
      "TIME_DELTA=2.833333333333334": 756,
      "TIME_DELTA=0.02499999999999991": 757,
      "TIME_DELTA=0.41666666666666674": 758,
      "TIME_DELTA=0.8749999999999982": 759,
      "TIME_DELTA=0.9166666666666667": 760,
      "TIME_DELTA=1.8541666666666667": 761,
      "TIME_DELTA=2.0625": 762,
      "TIME_DELTA=3.0416666666666665": 763,
      "TIME_DELTA=4.083333333333333": 764,
      "TIME_DELTA=7.770833333333333": 765,
      "TIME_DELTA=9.270833333333334": 766,
      "TIME_DELTA=9.375": 767,
      "TIME_DELTA=0.06250000000000178": 768,
      "TIME_DELTA=0.14583333333333348": 769,
      "TIME_DELTA=0.5208333333333335": 770,
      "TIME_DELTA=0.7916666666666679": 771,
      "TIME_DELTA=1.416666666666667": 772,
      "TIME_DELTA=2.208333333333334": 773,
      "TIME_DELTA=3.4166666666666665": 774,
      "TIME_DELTA=3.958333333333332": 775,
      "TIME_DELTA=4.104166666666667": 776,
      "TIME_DELTA=5.145833333333333": 777,
      "TIME_DELTA=5.354166666666667": 778,
      "TIME_DELTA=9.583333333333334": 779,
      "TIME_DELTA=0.5666666666666664": 780,
      "TIME_DELTA=1.3999999999999995": 781,
      "TIME_DELTA=1.5416666666666665": 782,
      "TIME_DELTA=2.8125": 783,
      "TIME_DELTA=3.166666666666666": 784,
      "TIME_DELTA=5.25": 785,
      "TIME_DELTA=6.6875": 786,
      "INST=62": 787,
      "INST=90": 788,
      "TIME_DELTA=0.5416666666666667": 789,
      "TIME_DELTA=1.3666666666666667": 790,
      "TIME_DELTA=1.9333333333333336": 791,
      "TIME_DELTA=2.1333333333333333": 792,
      "TIME_DELTA=3.6875": 793,
      "TIME_DELTA=0.02083333333333337": 794,
      "TIME_DELTA=0.35416666666666663": 795,
      "TIME_DELTA=0.9791666666666679": 796,
      "TIME_DELTA=1.2291666666666665": 797,
      "TIME_DELTA=1.2291666666666667": 798,
      "TIME_DELTA=1.229166666666667": 799,
      "TIME_DELTA=1.95": 800,
      "TIME_DELTA=15.979166666666666": 801,
      "TIME_DELTA=3.7": 802,
      "TIME_DELTA=6.458333333333333": 803,
      "TIME_DELTA=0.16666666666666663": 804,
      "TIME_DELTA=0.3958333333333335": 805,
      "TIME_DELTA=2.1": 806,
      "TIME_DELTA=3.416666666666666": 807,
      "TIME_DELTA=5.75": 808,
      "TIME_DELTA=6.833333333333333": 809,
      "INST=89": 810,
      "TIME_DELTA=0.12499999999999822": 811,
      "TIME_DELTA=0.18749999999999822": 812,
      "TIME_DELTA=0.45833333333333326": 813,
      "TIME_DELTA=0.7708333333333321": 814,
      "TIME_DELTA=0.7916666666666667": 815,
      "TIME_DELTA=1.1250000000000009": 816,
      "TIME_DELTA=2.3125": 817,
      "INST=22": 818,
      "TIME_DELTA=0.11666666666666714": 819,
      "TIME_DELTA=0.13333333333333464": 820,
      "TIME_DELTA=0.21666666666666667": 821,
      "TIME_DELTA=0.21666666666666679": 822,
      "TIME_DELTA=1.0000000000000004": 823,
      "TIME_DELTA=15.5625": 824,
      "TIME_DELTA=2.979166666666666": 825,
      "TIME_DELTA=3.8": 826,
      "TIME_DELTA=3.895833333333334": 827,
      "TIME_DELTA=5.1875": 828,
      "TIME_DELTA=7.333333333333333": 829,
      "INST=4": 830,
      "INST=43": 831,
      "TIME_DELTA=0.010416666666666075": 832,
      "TIME_DELTA=0.12499999999999911": 833,
      "TIME_DELTA=0.24999999999999822": 834,
      "TIME_DELTA=1.583333333333333": 835,
      "TIME_DELTA=1.770833333333334": 836,
      "TIME_DELTA=1.9749999999999996": 837,
      "TIME_DELTA=14.833333333333334": 838,
      "TIME_DELTA=2.5833333333333335": 839,
      "TIME_DELTA=2.7083333333333335": 840,
      "TIME_DELTA=4.020833333333333": 841,
      "TIME_DELTA=5.416666666666667": 842,
      "TIME_DELTA=9.791666666666666": 843,
      "TIME_DELTA=0.16666666666666669": 844,
      "TIME_DELTA=0.2500000000000018": 845,
      "TIME_DELTA=1.0208333333333335": 846,
      "TIME_DELTA=1.3": 847,
      "TIME_DELTA=1.4666666666666666": 848,
      "TIME_DELTA=1.541666666666667": 849,
      "TIME_DELTA=15.291666666666666": 850,
      "TIME_DELTA=2.2083333333333335": 851,
      "TIME_DELTA=2.2333333333333334": 852,
      "TIME_DELTA=2.7916666666666665": 853,
      "TIME_DELTA=3.8666666666666667": 854,
      "TIME_DELTA=8.5": 855,
      "TIME_DELTA=9.291666666666666": 856,
      "TIME_DELTA=9.9375": 857,
      "INST=102": 858,
      "INST=51": 859,
      "TIME_DELTA=1.0833333333333321": 860,
      "TIME_DELTA=1.1249999999999991": 861,
      "TIME_DELTA=1.520833333333333": 862,
      "TIME_DELTA=1.6333333333333333": 863,
      "TIME_DELTA=1.854166666666666": 864,
      "TIME_DELTA=1.9833333333333334": 865,
      "TIME_DELTA=14.166666666666666": 866,
      "TIME_DELTA=2.916666666666666": 867,
      "TIME_DELTA=3.291666666666666": 868,
      "TIME_DELTA=3.458333333333334": 869,
      "TIME_DELTA=3.5999999999999996": 870,
      "TIME_DELTA=5.520833333333333": 871,
      "TIME_DELTA=5.895833333333333": 872,
      "TIME_DELTA=7.1875": 873,
      "TIME_DELTA=7.25": 874,
      "TIME_DELTA=7.916666666666668": 875,
      "TIME_DELTA=9.166666666666666": 876,
      "TIME_DELTA=9.5": 877,
      "INST=3": 878,
      "INST=8": 879,
      "TIME_DELTA=0.12500000000000044": 880,
      "TIME_DELTA=1.1250000000000004": 881,
      "TIME_DELTA=2.2291666666666665": 882,
      "TIME_DELTA=3.2083333333333335": 883,
      "TIME_DELTA=3.583333333333334": 884,
      "TIME_DELTA=3.708333333333334": 885,
      "TIME_DELTA=3.8125": 886,
      "TIME_DELTA=4.208333333333333": 887,
      "TIME_DELTA=5.041666666666667": 888,
      "TIME_DELTA=7.583333333333332": 889,
      "TIME_DELTA=9.979166666666666": 890,
      "INST=119": 891,
      "TIME_DELTA=0.10416666666666674": 892,
      "TIME_DELTA=0.2499999999999991": 893,
      "TIME_DELTA=0.6249999999999998": 894,
      "TIME_DELTA=2.458333333333333": 895,
      "TIME_DELTA=4.833333333333333": 896,
      "TIME_DELTA=4.875": 897,
      "TIME_DELTA=5.395833333333333": 898,
      "TIME_DELTA=7.9375": 899,
      "TIME_DELTA=0.08333333333333337": 900,
      "TIME_DELTA=0.35416666666666785": 901,
      "TIME_DELTA=0.7333333333333325": 902,
      "TIME_DELTA=0.8750000000000002": 903,
      "TIME_DELTA=0.8750000000000004": 904,
      "TIME_DELTA=0.8958333333333335": 905,
      "TIME_DELTA=1.2708333333333333": 906,
      "TIME_DELTA=1.4333333333333333": 907,
      "TIME_DELTA=1.4791666666666679": 908,
      "TIME_DELTA=14.958333333333334": 909,
      "TIME_DELTA=2.291666666666667": 910,
      "TIME_DELTA=2.333333333333334": 911,
      "TIME_DELTA=2.8": 912,
      "TIME_DELTA=3.541666666666666": 913,
      "TIME_DELTA=3.566666666666667": 914,
      "INST=26": 915,
      "TIME_DELTA=0.22916666666666652": 916,
      "TIME_DELTA=0.37500000000000044": 917,
      "TIME_DELTA=0.6000000000000001": 918,
      "TIME_DELTA=0.8958333333333321": 919,
      "TIME_DELTA=1.8000000000000007": 920,
      "TIME_DELTA=1.8666666666666671": 921,
      "TIME_DELTA=2.3": 922,
      "TIME_DELTA=7.833333333333333": 923,
      "TIME_DELTA=1.2500000000000018": 924,
      "TIME_DELTA=1.5208333333333333": 925,
      "TIME_DELTA=1.5666666666666664": 926,
      "TIME_DELTA=14.5": 927,
      "TIME_DELTA=4.833333333333332": 928,
      "TIME_DELTA=5.229166666666667": 929,
      "TIME_DELTA=6.4": 930,
      "TIME_DELTA=7.166666666666667": 931,
      "INST=99": 932,
      "TIME_DELTA=0.016666666666666607": 933,
      "TIME_DELTA=0.3083333333333331": 934,
      "TIME_DELTA=0.3750000000000009": 935,
      "TIME_DELTA=0.7500000000000004": 936,
      "TIME_DELTA=1.2000000000000002": 937,
      "TIME_DELTA=13.958333333333334": 938,
      "TIME_DELTA=2.791666666666666": 939,
      "TIME_DELTA=3.125": 940,
      "TIME_DELTA=4.125": 941,
      "TIME_DELTA=4.916666666666667": 942,
      "TIME_DELTA=5.979166666666668": 943,
      "TIME_DELTA=6.041666666666667": 944,
      "TIME_DELTA=9.145833333333334": 945,
      "INST=54": 946,
      "TIME_DELTA=0.04166666666666667": 947,
      "TIME_DELTA=0.15000000000000036": 948,
      "TIME_DELTA=0.23333333333333428": 949,
      "TIME_DELTA=0.30000000000000004": 950,
      "TIME_DELTA=0.6250000000000004": 951,
      "TIME_DELTA=1.6041666666666667": 952,
      "TIME_DELTA=1.729166666666667": 953,
      "TIME_DELTA=1.7833333333333334": 954,
      "TIME_DELTA=1.9999999999999998": 955,
      "TIME_DELTA=10.958333333333334": 956,
      "TIME_DELTA=15.625": 957,
      "TIME_DELTA=15.708333333333334": 958,
      "TIME_DELTA=2.020833333333333": 959,
      "TIME_DELTA=2.4166666666666665": 960,
      "TIME_DELTA=3.1875": 961,
      "TIME_DELTA=3.7708333333333335": 962,
      "TIME_DELTA=5.583333333333332": 963,
      "TIME_DELTA=6.25": 964,
      "TIME_DELTA=7.916666666666667": 965,
      "INST=63": 966,
      "INST=84": 967,
      "INST=94": 968,
      "TIME_DELTA=0.01666666666666572": 969,
      "TIME_DELTA=0.18333333333333324": 970,
      "TIME_DELTA=0.2833333333333332": 971,
      "TIME_DELTA=0.29166666666666663": 972,
      "TIME_DELTA=0.675": 973,
      "TIME_DELTA=0.7708333333333335": 974,
      "TIME_DELTA=1.2500000000000004": 975,
      "TIME_DELTA=1.5666666666666667": 976,
      "TIME_DELTA=1.6333333333333329": 977,
      "TIME_DELTA=1.8833333333333333": 978,
      "TIME_DELTA=11.0": 979,
      "TIME_DELTA=11.75": 980,
      "TIME_DELTA=15.25": 981,
      "TIME_DELTA=15.9375": 982,
      "TIME_DELTA=2.770833333333334": 983,
      "TIME_DELTA=4.979166666666668": 984,
      "TIME_DELTA=6.479166666666667": 985,
      "TIME_DELTA=7.625": 986,
      "TIME_DELTA=0.7291666666666665": 987,
      "TIME_DELTA=0.8999999999999999": 988,
      "TIME_DELTA=1.1249999999999996": 989,
      "TIME_DELTA=11.666666666666666": 990,
      "TIME_DELTA=13.966666666666667": 991,
      "TIME_DELTA=2.999999999999999": 992,
      "TIME_DELTA=3.2916666666666665": 993,
      "TIME_DELTA=4.708333333333332": 994,
      "TIME_DELTA=4.8": 995,
      "INST=116": 996,
      "TIME_DELTA=0.08333333333333331": 997,
      "TIME_DELTA=0.3749999999999991": 998,
      "TIME_DELTA=0.6999999999999993": 999,
      "TIME_DELTA=1.0000000000000002": 1000,
      "TIME_DELTA=1.2083333333333321": 1001,
      "TIME_DELTA=1.9999999999999996": 1002,
      "TIME_DELTA=14.333333333333334": 1003,
      "TIME_DELTA=15.416666666666666": 1004,
      "TIME_DELTA=15.866666666666667": 1005,
      "TIME_DELTA=15.9": 1006,
      "TIME_DELTA=2.208333333333333": 1007,
      "TIME_DELTA=2.291666666666666": 1008,
      "TIME_DELTA=2.466666666666667": 1009,
      "TIME_DELTA=2.645833333333334": 1010,
      "TIME_DELTA=4.416666666666667": 1011,
      "TIME_DELTA=6.291666666666667": 1012,
      "TIME_DELTA=7.458333333333332": 1013,
      "TIME_DELTA=7.666666666666667": 1014,
      "INST=69": 1015,
      "NOTE_OFF=19": 1016,
      "NOTE_ON=19": 1017,
      "TIME_DELTA=0.8749999999999996": 1018,
      "TIME_DELTA=1.3666666666666671": 1019,
      "TIME_DELTA=1.479166666666667": 1020,
      "TIME_DELTA=2.0208333333333335": 1021,
      "TIME_DELTA=4.041666666666666": 1022,
      "TIME_DELTA=7.875": 1023,
      "TIME_DELTA=0.010416666666666666": 1024,
      "TIME_DELTA=0.10000000000000009": 1025,
      "TIME_DELTA=0.29999999999999893": 1026,
      "TIME_DELTA=0.8833333333333333": 1027,
      "TIME_DELTA=1.1250000000000002": 1028,
      "TIME_DELTA=11.975": 1029,
      "TIME_DELTA=2.0166666666666666": 1030,
      "TIME_DELTA=2.05": 1031,
      "TIME_DELTA=2.4": 1032,
      "TIME_DELTA=2.433333333333333": 1033,
      "NOTE_OFF=103": 1034,
      "NOTE_ON=103": 1035,
      "TIME_DELTA=0.04166666666666666": 1036,
      "TIME_DELTA=0.22916666666666674": 1037,
      "TIME_DELTA=0.22916666666666785": 1038,
      "TIME_DELTA=0.27083333333333326": 1039,
      "TIME_DELTA=0.31666666666666643": 1040,
      "TIME_DELTA=0.3541666666666665": 1041,
      "TIME_DELTA=0.6083333333333333": 1042,
      "TIME_DELTA=0.7499999999999991": 1043,
      "TIME_DELTA=0.8750000000000009": 1044,
      "TIME_DELTA=1.3750000000000004": 1045,
      "TIME_DELTA=1.7916666666666679": 1046,
      "TIME_DELTA=1.8749999999999982": 1047,
      "TIME_DELTA=2.2": 1048,
      "TIME_DELTA=3.208333333333334": 1049,
      "TIME_DELTA=3.5625": 1050,
      "TIME_DELTA=3.729166666666666": 1051,
      "TIME_DELTA=3.7333333333333334": 1052,
      "TIME_DELTA=3.833333333333332": 1053,
      "TIME_DELTA=4.083333333333334": 1054,
      "TIME_DELTA=4.1875": 1055,
      "TIME_DELTA=4.375": 1056,
      "TIME_DELTA=6.033333333333333": 1057,
      "INST=5": 1058,
      "INST=98": 1059,
      "TIME_DELTA=0.06249999999999911": 1060,
      "TIME_DELTA=0.10000000000000142": 1061,
      "TIME_DELTA=0.18750000000000022": 1062,
      "TIME_DELTA=0.20833333333333337": 1063,
      "TIME_DELTA=0.2833333333333333": 1064,
      "TIME_DELTA=0.3333333333333357": 1065,
      "TIME_DELTA=0.39583333333333215": 1066,
      "TIME_DELTA=0.5000000000000004": 1067,
      "TIME_DELTA=0.6041666666666665": 1068,
      "TIME_DELTA=0.9749999999999996": 1069,
      "TIME_DELTA=1.9479166666666679": 1070,
      "TIME_DELTA=1.975": 1071,
      "TIME_DELTA=15.433333333333334": 1072,
      "TIME_DELTA=15.895833333333334": 1073,
      "TIME_DELTA=2.3666666666666667": 1074,
      "TIME_DELTA=3.7666666666666666": 1075,
      "TIME_DELTA=3.783333333333333": 1076,
      "TIME_DELTA=3.933333333333333": 1077,
      "TIME_DELTA=4.166666666666666": 1078,
      "TIME_DELTA=5.541666666666667": 1079,
      "TIME_DELTA=5.5625": 1080,
      "TIME_DELTA=7.033333333333333": 1081,
      "NOTE_OFF=105": 1082,
      "NOTE_ON=105": 1083,
      "TIME_DELTA=0.025": 1084,
      "TIME_DELTA=0.6416666666666667": 1085,
      "TIME_DELTA=0.8749999999999991": 1086,
      "TIME_DELTA=1.2499999999999991": 1087,
      "TIME_DELTA=1.4583333333333335": 1088,
      "TIME_DELTA=1.854166666666667": 1089,
      "TIME_DELTA=1.9375000000000009": 1090,
      "TIME_DELTA=1.9999999999999982": 1091,
      "TIME_DELTA=14.25": 1092,
      "TIME_DELTA=2.000000000000001": 1093,
      "TIME_DELTA=2.4375": 1094,
      "TIME_DELTA=2.666666666666666": 1095,
      "TIME_DELTA=3.395833333333334": 1096,
      "TIME_DELTA=4.0625": 1097,
      "TIME_DELTA=5.083333333333333": 1098,
      "TIME_DELTA=5.3": 1099,
      "TIME_DELTA=5.533333333333333": 1100,
      "TIME_DELTA=5.729166666666667": 1101,
      "TIME_DELTA=5.933333333333334": 1102,
      "TIME_DELTA=8.083333333333334": 1103,
      "INST=21": 1104,
      "NOTE_OFF=101": 1105,
      "NOTE_OFF=106": 1106,
      "NOTE_ON=101": 1107,
      "NOTE_ON=106": 1108,
      "TIME_DELTA=0.016666666666667496": 1109,
      "TIME_DELTA=0.3750000000000018": 1110,
      "TIME_DELTA=0.4791666666666665": 1111,
      "TIME_DELTA=0.47916666666666785": 1112,
      "TIME_DELTA=0.5000000000000009": 1113,
      "TIME_DELTA=0.95": 1114,
      "TIME_DELTA=0.9833333333333333": 1115,
      "TIME_DELTA=1.3749999999999991": 1116,
      "TIME_DELTA=1.4791666666666667": 1117,
      "TIME_DELTA=1.7999999999999998": 1118,
      "TIME_DELTA=1.8166666666666667": 1119,
      "TIME_DELTA=15.125": 1120,
      "TIME_DELTA=15.208333333333334": 1121,
      "TIME_DELTA=15.8": 1122,
      "TIME_DELTA=2.1041666666666665": 1123,
      "TIME_DELTA=2.458333333333334": 1124,
      "TIME_DELTA=3.083333333333334": 1125,
      "TIME_DELTA=3.666666666666667": 1126,
      "TIME_DELTA=3.9": 1127,
      "TIME_DELTA=5.770833333333333": 1128,
      "TIME_DELTA=6.3125": 1129,
      "TIME_DELTA=6.75": 1130,
      "TIME_DELTA=7.041666666666667": 1131,
      "TIME_DELTA=7.375": 1132,
      "TIME_DELTA=8.033333333333333": 1133,
      "INST=93": 1134,
      "NOTE_OFF=107": 1135,
      "NOTE_ON=107": 1136,
      "TIME_DELTA=0.09166666666666679": 1137,
      "TIME_DELTA=0.25000000000000044": 1138,
      "TIME_DELTA=0.30833333333333335": 1139,
      "TIME_DELTA=0.49999999999999956": 1140,
      "TIME_DELTA=0.7833333333333332": 1141,
      "TIME_DELTA=0.8749999999999998": 1142,
      "TIME_DELTA=0.8750000000000018": 1143,
      "TIME_DELTA=1.2333333333333325": 1144,
      "TIME_DELTA=1.2999999999999998": 1145,
      "TIME_DELTA=1.4333333333333336": 1146,
      "TIME_DELTA=1.770833333333333": 1147,
      "TIME_DELTA=1.8166666666666664": 1148,
      "TIME_DELTA=10.041666666666666": 1149,
      "TIME_DELTA=2.416666666666666": 1150,
      "TIME_DELTA=3.9333333333333336": 1151,
      "TIME_DELTA=5.6875": 1152,
      "TIME_DELTA=5.791666666666667": 1153,
      "TIME_DELTA=7.583333333333333": 1154,
      "TIME_DELTA=9.4375": 1155,
      "TIME_DELTA=9.479166666666666": 1156,
      "INST=81": 1157,
      "INST=87": 1158,
      "TIME_DELTA=0.0416666666666643": 1159,
      "TIME_DELTA=0.225": 1160,
      "TIME_DELTA=0.22500000000000053": 1161,
      "TIME_DELTA=0.31666666666666665": 1162,
      "TIME_DELTA=0.3749999999999982": 1163,
      "TIME_DELTA=0.4999999999999982": 1164,
      "TIME_DELTA=0.7499999999999982": 1165,
      "TIME_DELTA=0.9375000000000004": 1166,
      "TIME_DELTA=0.9666666666666666": 1167,
      "TIME_DELTA=1.0208333333333321": 1168,
      "TIME_DELTA=1.604166666666667": 1169,
      "TIME_DELTA=1.645833333333333": 1170,
      "TIME_DELTA=1.729166666666666": 1171,
      "TIME_DELTA=11.833333333333334": 1172,
      "TIME_DELTA=14.041666666666666": 1173,
      "TIME_DELTA=2.020833333333334": 1174,
      "TIME_DELTA=2.3541666666666665": 1175,
      "TIME_DELTA=2.933333333333333": 1176,
      "TIME_DELTA=3.3": 1177,
      "TIME_DELTA=3.374999999999999": 1178,
      "TIME_DELTA=3.8541666666666665": 1179,
      "TIME_DELTA=3.8833333333333333": 1180,
      "TIME_DELTA=4.75": 1181,
      "TIME_DELTA=4.9375": 1182,
      "TIME_DELTA=7.520833333333333": 1183,
      "TIME_DELTA=9.5625": 1184,
      "TIME_DELTA=9.625": 1185,
      "INST=95": 1186,
      "TIME_DELTA=0.016666666666666663": 1187,
      "TIME_DELTA=0.2250000000000001": 1188,
      "TIME_DELTA=0.4999999999999998": 1189,
      "TIME_DELTA=0.6749999999999998": 1190,
      "TIME_DELTA=1.0000000000000018": 1191,
      "TIME_DELTA=1.0624999999999991": 1192,
      "TIME_DELTA=1.2666666666666657": 1193,
      "TIME_DELTA=1.3833333333333329": 1194,
      "TIME_DELTA=1.4791666666666665": 1195,
      "TIME_DELTA=1.5000000000000009": 1196,
      "TIME_DELTA=1.7083333333333321": 1197,
      "TIME_DELTA=1.9499999999999993": 1198,
      "TIME_DELTA=10.166666666666666": 1199,
      "TIME_DELTA=12.75": 1200,
      "TIME_DELTA=13.916666666666666": 1201,
      "TIME_DELTA=15.458333333333334": 1202,
      "TIME_DELTA=2.083333333333333": 1203,
      "TIME_DELTA=2.15": 1204,
      "TIME_DELTA=2.4000000000000004": 1205,
      "TIME_DELTA=2.541666666666666": 1206,
      "TIME_DELTA=2.666666666666667": 1207,
      "TIME_DELTA=2.979166666666668": 1208,
      "TIME_DELTA=3.9833333333333334": 1209,
      "TIME_DELTA=4.791666666666667": 1210,
      "TIME_DELTA=9.3125": 1211,
      "TIME_DELTA=9.395833333333334": 1212,
      "TIME_DELTA=0.010416666666666963": 1213,
      "TIME_DELTA=0.14583333333333326": 1214,
      "TIME_DELTA=0.4333333333333331": 1215,
      "TIME_DELTA=1.2500000000000009": 1216,
      "TIME_DELTA=1.2666666666666675": 1217,
      "TIME_DELTA=1.3541666666666667": 1218,
      "TIME_DELTA=1.4166666666666665": 1219,
      "TIME_DELTA=1.4583333333333321": 1220,
      "TIME_DELTA=1.6458333333333333": 1221,
      "TIME_DELTA=1.7000000000000002": 1222,
      "TIME_DELTA=1.9791666666666679": 1223,
      "TIME_DELTA=11.375": 1224,
      "TIME_DELTA=11.625": 1225,
      "TIME_DELTA=11.875": 1226,
      "TIME_DELTA=12.041666666666666": 1227,
      "TIME_DELTA=13.0": 1228,
      "TIME_DELTA=14.666666666666666": 1229,
      "TIME_DELTA=2.1999999999999993": 1230,
      "TIME_DELTA=3.041666666666666": 1231,
      "TIME_DELTA=3.4": 1232,
      "TIME_DELTA=3.6458333333333335": 1233,
      "TIME_DELTA=5.3125": 1234,
      "TIME_DELTA=5.633333333333334": 1235,
      "TIME_DELTA=5.866666666666666": 1236,
      "TIME_DELTA=5.916666666666668": 1237,
      "TIME_DELTA=6.625": 1238,
      "TIME_DELTA=6.800000000000001": 1239,
      "INST=10": 1240,
      "INST=11": 1241,
      "INST=66": 1242,
      "NOTE_OFF=99": 1243,
      "NOTE_ON=99": 1244,
      "TIME_DELTA=0.39999999999999947": 1245,
      "TIME_DELTA=0.45833333333333337": 1246,
      "TIME_DELTA=0.6249999999999991": 1247,
      "TIME_DELTA=0.6458333333333321": 1248,
      "TIME_DELTA=0.7333333333333343": 1249,
      "TIME_DELTA=0.8124999999999996": 1250,
      "TIME_DELTA=1.1166666666666671": 1251,
      "TIME_DELTA=1.2916666666666679": 1252,
      "TIME_DELTA=1.3000000000000007": 1253,
      "TIME_DELTA=1.4166666666666679": 1254,
      "TIME_DELTA=1.4999999999999991": 1255,
      "TIME_DELTA=1.6999999999999993": 1256,
      "TIME_DELTA=1.7166666666666668": 1257,
      "TIME_DELTA=12.166666666666666": 1258,
      "TIME_DELTA=13.066666666666666": 1259,
      "TIME_DELTA=14.4": 1260,
      "TIME_DELTA=15.729166666666666": 1261,
      "TIME_DELTA=15.766666666666667": 1262,
      "TIME_DELTA=2.220446049250313e-16": 1263,
      "TIME_DELTA=2.2666666666666666": 1264,
      "TIME_DELTA=2.5416666666666665": 1265,
      "TIME_DELTA=2.7333333333333334": 1266,
      "TIME_DELTA=3.6333333333333333": 1267,
      "TIME_DELTA=4.625": 1268,
      "TIME_DELTA=5.033333333333333": 1269,
